In [2]:
import pandas as pd
import numpy as np
from pandas import DataFrame,Series

In [5]:
df=DataFrame(np.random.randn(5,4),columns=list('WXYZ'),index=list('ABCDE'))

In [6]:
df

          W         X         Y         Z
A -1.346104  0.856568  0.745774 -0.023159
B  0.298371 -0.857391  0.229804  1.479137
C -0.917641  0.280174  0.583075 -0.238200
D -0.571020  0.649252 -0.614515 -0.173494
E -0.074735 -0.383277 -0.119875 -1.110449

In [7]:
df.reset_index()   # Reset to default 0,1,...n index

  index         W         X         Y         Z
0     A -1.346104  0.856568  0.745774 -0.023159
1     B  0.298371 -0.857391  0.229804  1.479137
2     C -0.917641  0.280174  0.583075 -0.238200
3     D -0.571020  0.649252 -0.614515 -0.173494
4     E -0.074735 -0.383277 -0.119875 -1.110449

In [10]:
rewind='CA NY WY OR CO'.split()
rewind

['CA', 'NY', 'WY', 'OR', 'CO']

In [11]:
df['States']=rewind

In [12]:
df

          W         X         Y         Z States
A -1.346104  0.856568  0.745774 -0.023159     CA
B  0.298371 -0.857391  0.229804  1.479137     NY
C -0.917641  0.280174  0.583075 -0.238200     WY
D -0.571020  0.649252 -0.614515 -0.173494     OR
E -0.074735 -0.383277 -0.119875 -1.110449     CO

In [13]:
df.set_index('States') # INDEXING according to States

               W         X         Y         Z
States
CA     -1.346104  0.856568  0.745774 -0.023159
NY      0.298371 -0.857391  0.229804  1.479137
WY     -0.917641  0.280174  0.583075 -0.238200
OR     -0.571020  0.649252 -0.614515 -0.173494
CO     -0.074735 -0.383277 -0.119875 -1.110449

In [14]:
df.set_index('States',inplace=True)

In [15]:
df

               W         X         Y         Z
States
CA     -1.346104  0.856568  0.745774 -0.023159
NY      0.298371 -0.857391  0.229804  1.479137
WY     -0.917641  0.280174  0.583075 -0.238200
OR     -0.571020  0.649252 -0.614515 -0.173494
CO     -0.074735 -0.383277 -0.119875 -1.110449

In [18]:
df1=DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [19]:
df1

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

## Info on Unique Values (Imporatant Function)

In [22]:
df1['col2'].unique()

array([444, 555, 666], dtype=int64)

In [24]:
df1['col2'].nunique() # no. of unique values

3

In [27]:
df1['col2'].value_counts() # it how many time the unique value is occured in column

444    2
555    1
666    1
Name: col2, dtype: int64

In [33]:
newdf=df1[(df1['col1']>2) & (df1['col2']==444)]

In [34]:
newdf

   col1  col2 col3
3     4   444  xyz

In [35]:
newdf=df1[(df1['col1']>2) | (df1['col2']==444)]

In [36]:
newdf

   col1  col2 col3
0     1   444  abc
2     3   666  ghi
3     4   444  xyz

In [37]:
newdf=df1[(df1['col1']>2) | (df1['col2']==666)]

In [38]:
newdf

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

## Applying Functions

In [39]:
def times2(x):
    return x*2

In [41]:
df1['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [42]:
df1['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

## Aggregate Function

In [43]:
df=DataFrame({'Number':[0,1,2,3,4],'Age':[29,29,24,20,22],'Weight':[60,75,67,75,46],'Salary':[48229,31188,21518,23543,30092]})

In [44]:
df

   Number  Age  Weight  Salary
0       0   29      60   48229
1       1   29      75   31188
2       2   24      67   21518
3       3   20      75   23543
4       4   22      46   30092

In [45]:
df.head() #head=top 5 tail=last 5

   Number  Age  Weight  Salary
0       0   29      60   48229
1       1   29      75   31188
2       2   24      67   21518
3       3   20      75   23543
4       4   22      46   30092

In [46]:
df.aggregate(['sum','min'])

     Number  Age  Weight  Salary
sum      10  124     323  154570
min       0   20      46   21518

In [48]:
df.aggregate({'Number':['sum','min'],'Age':['max','min'],'Weight':['min','sum'],'Salary':['max','sum']})

     Number   Age  Weight    Salary
max     NaN  29.0     NaN   48229.0
min     0.0  20.0    46.0       NaN
sum    10.0   NaN   323.0  154570.0

In [68]:
from numpy import arange

In [73]:
df1=DataFrame({'Number':arange(50),'Age':np.random.randint(20,80,50),'Weight':np.random.randint(50,100,50),'Salary':np.random.randint(30000,50000,50)})

In [76]:
df1.head()

   Number  Age  Weight  Salary
0       0   78      97   31136
1       1   48      84   44696
2       2   50      92   47426
3       3   36      66   32789
4       4   40      73   34955

In [77]:
df1.head(10)

   Number  Age  Weight  Salary
0       0   78      97   31136
1       1   48      84   44696
2       2   50      92   47426
3       3   36      66   32789
4       4   40      73   34955
5       5   58      62   36520
6       6   29      77   36669
7       7   51      55   41704
8       8   28      67   48632
9       9   79      90   44879

In [78]:
df1.tail()

    Number  Age  Weight  Salary
45      45   62      59   46403
46      46   35      78   31905
47      47   60      80   48946
48      48   60      75   41621
49      49   43      51   41357

## DateTime Function

In [50]:
date = '25/09/2019'

In [51]:
type(date)

str

In [52]:
date= pd.to_datetime(date)

In [53]:
type(date)

pandas._libs.tslibs.timestamps.Timestamp

In [54]:
date

Timestamp('2019-09-25 00:00:00')

In [55]:
import datetime

In [56]:
x=datetime.datetime.now()

In [57]:
x

datetime.datetime(2019, 9, 25, 17, 47, 9, 542591)

In [58]:
print(x)

2019-09-25 17:47:09.542591

In [59]:
print(x.year)

2019

In [61]:
x.year

2019

In [62]:
x.day

25

In [63]:
x.month

9

In [64]:
print(x.strftime("%A"))

Wednesday

In [65]:
print(x.strftime("%B"))

September

In [66]:
print(x.strftime("%C"))

20